In [1]:
import pandas
pandas.__version__

'1.1.3'

In [2]:
import pandas as pd

In [3]:
pd.DataFrame({'Yes': [50,21], 'No': [131,2]})

   Yes   No
0   50  131
1   21    2

In [5]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [6]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [7]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [13]:
wine_reviews = pd.read_csv("E:/2021 Winter Semester/COMP 4522 Database2/Miscellaneous/wine.csv")

In [14]:
wine_reviews.shape

(3, 4)

In [15]:
wine_reviews.head()

   Product A  Product B  Product C  Unnamed: 3
0         30         21          9         NaN
1         35         34          1         NaN
2         41         11         11         NaN

In [16]:
wine_reviews = pd.read_csv("E:/2021 Winter Semester/COMP 4522 Database2/Miscellaneous/wine.csv",
                           index_col=0)
wine_reviews.head()

           Product B  Product C  Unnamed: 3
Product A
30                21          9         NaN
35                34          1         NaN
41                11         11         NaN